Задача 1
Опишите кратко, в чём основное отличие полной (аппаратной) виртуализации, паравиртуализации и виртуализации на основе ОС.
Основное отличие – то, как организована работа с гостевыми ОС
При аппаратной виртуализации нет необходимости модифицировать гостевую ОС. ОС получает прямой доступ к аппаратным ресурсам, работая с приоритетом уровня 0, что положительно сказывается на производительности при прочих равных.
При паравирутализации возникает необходимость модификации ядра и драйверов. Возникают накладные расходы на взаимодействие с ресурсами через ядро хост ОС.
При контейнеризации гостевая ОС не имеет собственного ядра, используется ядро ОС хоста. За счет этого вырастает скорость инициализации гостевой ОС.

Задача 2
Выберите один из вариантов использования организации физических серверов в зависимости от условий использования.
Организация серверов:
•	физические сервера,
•	паравиртуализация,
•	виртуализация уровня ОС.
Условия использования:
•	высоконагруженная база данных, чувствительная к отказу;
•	различные web-приложения;
•	Windows-системы для использования бухгалтерским отделом;
•	системы, выполняющие высокопроизводительные расчёты на GPU.
Опишите, почему вы выбрали к каждому целевому использованию такую организацию.

•	высоконагруженная база данных, чувствительная к отказу;
физические сервера
высокие нагрузки чувствительны к времени отклика и прослойка гипервизора и ПО для виртуализации приносит дополнительные накладные расходы на обслуживание и как следствие становится дополнительным элементом отказа (дефекты производительности, особенности эксплуатации, тонкий тюнинг). 
отказоустойчивость можно достичь резервированием.
говоря про надежность и производительность - высоконагруженные системы и сервисы не любят коммунальности в ресурсах, а при паравирутализации и виртуализации уровня ОС «соседи» могут утилизировать необходимые ресурсы и стать причиной отказа
 
•	различные web-приложения
виртуализация уровня ОС (контейнеризация). индустриальный стандарт и требования к веб приложениям – развертывать часто и много приложений (разные версии/разные приложения) при этом максимально оптимально утилизировать имеющиеся ресурсы. Преимущества виртуализации уровня ОС походят для этих задач больше, чем физические сервера и паравиртуализация потому, что позволяют управлять таким ландшафтом быстрее и эффективнее.

•	Windows-системы для использования бухгалтерским отделом;
Паравирутализация. На мой вкус этот выбор обусловлен ограничением Windows системы и бюджетом, обычно под такие задачи эффективнее использовать решения с низким порогом входа и стоимостью лицензий. Аппаратная виртуализация так же доступна в случае, если нужны дополнительные аспекты по доступности и производительности.

•	системы, выполняющие высокопроизводительные расчёты на GPU.
Виртуализация средствами ОС. Высокопроизводительные расчеты на GPU востребованы в научных проектах, проектировании и эмуляции работы сложных систем, таких как двигатели и т.п. плюс проекты связанные с машинным обучением. Доступ к драйверами и возможности использования параллельные вычисления доступна только в виртуализации средствами ОС

Задача 3
Выберите подходящую систему управления виртуализацией для предложенного сценария. Детально опишите ваш выбор.
Сценарии:

1.	100 виртуальных машин на базе Linux и Windows, общие задачи, нет особых требований. Преимущественно Windows based-инфраструктура, требуется реализация программных балансировщиков нагрузки, репликации данных и автоматизированного механизма создания резервных копий.
Коммерческие решения - VMware, Hyper-V. Отвечают требованиям по балансировке, реплицаии и резервному копированию. Поддерживают Windows based-инфраструктуру.

2.	Требуется наиболее производительное бесплатное open source-решение для виртуализации небольшой (20-30 серверов) инфраструктуры на базе Linux и Windows виртуальных машин.
Proxmox в режиме KVM. OpenSource,поддерживает Linux и Windows , имеет возможности по управлению сравнимые с платными гипервизорами.

3.	Необходимо бесплатное, максимально совместимое и производительное решение для виртуализации Windows-инфраструктуры.
Hyper-V Server - абсолютная совместимость с продуктами MicroSoft, отвечает требованиям по производительности. бесплатный.

4.	Необходимо рабочее окружение для тестирования программного продукта на нескольких дистрибутивах Linux.
KVM - совместим с большим количеством дистрибутивов Linux, позволяет не тратить деньги на лицензии, низкий порогом вхождения, активно развивается.


Задача 4
Опишите возможные проблемы и недостатки гетерогенной среды виртуализации (использования нескольких систем управления виртуализацией одновременно) и что необходимо сделать для минимизации этих рисков и проблем. Если бы у вас был выбор, создавали бы вы гетерогенную среду или нет? Мотивируйте ваш ответ примерами.

Проблемы и недостатки гетерогенной среды виртуализации:
- компетенции и экпертиза. доп расходы на штат инженеров, количество, такие активности как найм, адаптация и развитие компетенций.
- растет сложность сопровождения и поддержки. разные требования к hw и os, консоли управления, системы мониторинга (метрики, трейсы и логи), процессы обновления (устранение дефектов и уязвимостей), восстановления при сбоях, анализ причин сбоев и их устранение.

Действия для минимизации рисков и проблем:
-провести анализ текущего ландшафта и если гетерогенная среда неоправдана - отказ от гетерогенности
-по итогам анализа если гетерогенная среда - ок, снизить издержки за счет IaaS и IaC (автоматизировать ключевые, рутинные задачи поддержки и сопровождения)

Если бы у меня был выбор - я всегда отталкиваюсь от поставленных задач, если целесообразно создание гетерогенной среды, то решаем задачи связанные с оптимизацией сопровождения и поддержки такого решения. Работаем над стандартизацией и унификацией типов решений, не плодим инфраструктурные продукты и сервисы на поддержке
Не забываем следить за трендами и экспериментировать.
